; domain
(define (domain gripper-strips)

    (:predicates (room ?r)
                (ball ?b)
                (gripper ?g)
                (at-robby ?r)
                (at ?b ?r)
                (free ?g)
                (carry ?o ?g)
    )

    (:action move
        :parameters (?from ?to)
        :precondition (and (room ?from)(room ?to)(at-robby ?from))
        :effect (and
            (at-robby ?to)
            (not (at-robby ?from))
        )
    )
    (:action pick
        :parameters (?obj ?room ?gripper)
        :precondition (and (ball ?obj)(room ?room)(gripper ?gripper)(at ?obj ?room)(at-robby ?room)(free ?gripper))
        :effect (and
            (carry ?obj ?gripper)
            (not (at ?obj ?room))
            (not (free ?gripper))
        )
    )
    (:action drop
        :parameters (?obj ?room ?gripper)
        :precondition (and (ball ?obj)(room ?room)(gripper ?gripper)(carry ?obj ?gripper)(at-robby ?room))
        :effect (and
            (at ?obj ?room)
            (free ?gripper)
            (not (carry ?obj ?gripper))
        )
    )
)

; problem
(define (problem gripper-17)
(:domain gripper-strips)
(:objects rooma roomb room3 room4 left right ball1 ball2 ball3 ball4 ball5 ball6 ball7 ball8 ball9 ball10 ball11 ball12 ball13 ball14 ball15 ball16 ball17 )
(:init
(room rooma)
(room roomb)
(room room3)
(room room4)
(gripper left)
(gripper right)
(ball ball1)
(ball ball2)
(ball ball3)
(ball ball4)
(ball ball5)
(ball ball6)
(ball ball7)
(ball ball8)
(ball ball9)
(ball ball10)
(ball ball11)
(ball ball12)
(ball ball13)
(ball ball14)
(ball ball15)
(ball ball16)
(ball ball17)
(free left)
(free right)
(at ball1 rooma)
(at ball2 rooma)
(at ball3 rooma)
(at ball4 rooma)
(at ball5 roomb)
(at ball6 roomb)
(at ball7 roomb)
(at ball8 roomb)
(at ball9 room3)
(at ball10 room3)
(at ball11 room3)
(at ball12 room4)
(at ball13 room4)
(at ball14 room4)
(at ball15 room4)
(at ball16 room4)
(at ball17 room4)
(at-robby rooma)
)
(:goal
(and
(at ball1 roomb)
(at ball2 roomb)
(at ball3 roomb)
(at ball4 roomb)
(at ball5 roomb)
(at ball6 roomb)
(at ball7 roomb)
(at ball8 roomb)
(at ball9 roomb)
(at ball10 roomb)
(at ball11 roomb)
(at ball12 roomb)
(at ball13 roomb)
(at ball14 roomb)
(at ball15 roomb)
(at ball16 roomb)
(at ball17 roomb)
)
)
)

; plan
1. (pick ball4 rooma left)
   deleted: (at ball4 rooma) (free left)
   added: (carry ball4 left)
   goals met: 4 of 17
2. (pick ball3 rooma right)
   deleted: (at ball3 rooma) (free right)
   added: (carry ball3 right)
   goals met: 4 of 17
3. (move rooma roomb)
   deleted: (at-robby rooma)
   added: (at-robby roomb)
   goals met: 4 of 17
4. (drop ball3 roomb right)
   deleted: (carry ball3 right)
   added: (at ball3 roomb) (free right)
   goals met: 5 of 17
5. (drop ball4 roomb left)
   deleted: (carry ball4 left)
   added: (at ball4 roomb) (free left)
   goals met: 6 of 17
6. (move roomb room4)
   deleted: (at-robby roomb)
   added: (at-robby room4)
   goals met: 6 of 17
7. (pick ball17 room4 left)
   deleted: (at ball17 room4) (free left)
   added: (carry ball17 left)
   goals met: 6 of 17
8. (pick ball16 room4 right)
   deleted: (at ball16 room4) (free right)
   added: (carry ball16 right)
   goals met: 6 of 17
9. (move room4 roomb)
   deleted: (at-robby room4)
   added: (at-robby roomb)
   goals met: 6 of 17
10. (drop ball16 roomb right)
   deleted: (carry ball16 right)
   added: (at ball16 roomb) (free right)
   goals met: 7 of 17
11. (drop ball17 roomb left)
   deleted: (carry ball17 left)
   added: (at ball17 roomb) (free left)
   goals met: 8 of 17
12. (move roomb room4)
   deleted: (at-robby roomb)
   added: (at-robby room4)
   goals met: 8 of 17
13. (pick ball15 room4 left)
   deleted: (at ball15 room4) (free left)
   added: (carry ball15 left)
   goals met: 8 of 17
14. (pick ball14 room4 right)
   deleted: (at ball14 room4) (free right)
   added: (carry ball14 right)
   goals met: 8 of 17
15. (move room4 roomb)
   deleted: (at-robby room4)
   added: (at-robby roomb)
   goals met: 8 of 17
16. (drop ball14 roomb right)
   deleted: (carry ball14 right)
   added: (at ball14 roomb) (free right)
   goals met: 9 of 17
17. (drop ball15 roomb left)
   deleted: (carry ball15 left)
   added: (at ball15 roomb) (free left)
   goals met: 10 of 17
18. (move roomb room4)
   deleted: (at-robby roomb)
   added: (at-robby room4)
   goals met: 10 of 17
19. (pick ball13 room4 left)
   deleted: (at ball13 room4) (free left)
   added: (carry ball13 left)
   goals met: 10 of 17
20. (pick ball12 room4 right)
   deleted: (at ball12 room4) (free right)
   added: (carry ball12 right)
   goals met: 10 of 17
21. (move room4 roomb)
   deleted: (at-robby room4)
   added: (at-robby roomb)
   goals met: 10 of 17
22. (drop ball12 roomb right)
   deleted: (carry ball12 right)
   added: (at ball12 roomb) (free right)
   goals met: 11 of 17
23. (drop ball13 roomb left)
   deleted: (carry ball13 left)
   added: (at ball13 roomb) (free left)
   goals met: 12 of 17
24. (move roomb room3)
   deleted: (at-robby roomb)
   added: (at-robby room3)
   goals met: 12 of 17
25. (pick ball9 room3 left)
   deleted: (at ball9 room3) (free left)
   added: (carry ball9 left)
   goals met: 12 of 17
26. (pick ball11 room3 right)
   deleted: (at ball11 room3) (free right)
   added: (carry ball11 right)
   goals met: 12 of 17
27. (move room3 roomb)
   deleted: (at-robby room3)
   added: (at-robby roomb)
   goals met: 12 of 17
28. (drop ball11 roomb right)
   deleted: (carry ball11 right)
   added: (at ball11 roomb) (free right)
   goals met: 13 of 17
29. (drop ball9 roomb left)
   deleted: (carry ball9 left)
   added: (at ball9 roomb) (free left)
   goals met: 14 of 17
30. (move roomb room3)
   deleted: (at-robby roomb)
   added: (at-robby room3)
   goals met: 14 of 17
31. (pick ball10 room3 left)
   deleted: (at ball10 room3) (free left)
   added: (carry ball10 left)
   goals met: 14 of 17
32. (move room3 roomb)
   deleted: (at-robby room3)
   added: (at-robby roomb)
   goals met: 14 of 17
33. (drop ball10 roomb left)
   deleted: (carry ball10 left)
   added: (at ball10 roomb) (free left)
   goals met: 15 of 17
34. (move roomb rooma)
   deleted: (at-robby roomb)
   added: (at-robby rooma)
   goals met: 15 of 17
35. (pick ball2 rooma left)
   deleted: (at ball2 rooma) (free left)
   added: (carry ball2 left)
   goals met: 15 of 17
36. (pick ball1 rooma right)
   deleted: (at ball1 rooma) (free right)
   added: (carry ball1 right)
   goals met: 15 of 17
37. (move rooma roomb)
   deleted: (at-robby rooma)
   added: (at-robby roomb)
   goals met: 15 of 17
38. (drop ball2 roomb left)
   deleted: (carry ball2 left)
   added: (at ball2 roomb) (free left)
   goals met: 16 of 17
39. (drop ball1 roomb right)
   deleted: (carry ball1 right)
   added: (at ball1 roomb) (free right)
   goals met: 17 of 17
